{
  "episode_1": {
    "papers/0054.cermxml": {
      "abstract": "H G",
      "authors": {
        "name": "Alison Pease"
      },
      "keywords": [
        "Evaluating Machine Creativity",
        "by",
        "Alison Pease",
        "Daniel Winterstein",
        "Simon Colton"
      ],
      "references": {
        "reference_title": "The Creative Mind: Myths and Mechanisms"
      },
      "title": "Division of Informatics, University of Edinburgh"
    },
    "papers/095-Colton.cermxml": {
      "abstract": "We describe a corpus-based poetry generation system which uses templates to construct poems according to given constraints on rhyme, meter, stress, sentiment, word frequency and word similarity. Moreover, the software constructs a mood for the day by analysing newspaper articles; uses this to determine both an article to base a poem on and a template for the poem; creates an aesthetic based on relevance to the article, lyricism, sentiment and flamboyancy; searches for an instantiation of the template which maximises the aesthetic; and provides a commentary for the whole process to add value to the creative act. We describe the processes behind this approach, present some experimental results which helped in fine tuning, and provide some illustrative poems and commentaries. We argue that this is the first poetry system which generates examples, forms concepts, invents aesthetics and frames its work, and so can be assessed favourably with respect to the FACE model for comparing creative systems.",
      "authors": {
        "institution": "School of Computer Science and Informatics, University College Dublin",
        "name": "Tony Veale"
      },
      "keywords": [],
      "references": {
        "reference_title": "Systems, An Illustrated Overview."
      },
      "title": "Full-Face Poetry Generation"
    },
    "papers/978-1-4020-8852-0_8.cermxml": {
      "abstract": "I am apt to think, if we knew what it was to be an angel for one hour, we should return to this world, though it were to sit on the brightest throne in it, with vastly more loathing and reluctance than we would now descend into a loathsome dungeon or sepulchre1",
      "authors": {
        "name": "Nick Bostrom"
      },
      "keywords": [],
      "references": {
        "reference_title": "The Works of George Berkeley DD, Bishop of Cloyne"
      },
      "title": "Chapter 7 of Why I Want to be a Posthuman when I Grow Up"
    },
    "papers/bostrom.cermxml": {
      "abstract": "This paper traces the cultural and philosophical roots of transhumanist thought and describes some of the influences and contributions that led to the development of contemporary transhumanism.",
      "authors": {
        "institution": "Faculty of Philosophy, Oxford University",
        "name": "Nick Bostrom"
      },
      "keywords": [],
      "references": {
        "reference_title": "Human Genetic Enhancements: A Transhumanist Perspective"
      },
      "title": "A History of Transhumanist Thought"
    },
    "papers/brundage.cermxml": {
      "abstract": "Many experts believe that in the coming decades, artificial intelligence will change, and perhaps significantly reduce, the demand for human labor in the economy, but there remains much uncertainty about the accuracy of this claim and what to do about it. This paper identifies several ways in which the artificial intelligence community can help society to anticipate and shape such outcomes in a socially beneficial direction. First, different technical aspirations for the field of AI may be associated with different social outcomes, increasing the stakes of decisions made in the AI community. Second, the extent of researchers' efforts to apply AI to different social and economic domains will influence the distribution of cognition between humans and machines in those domains. Third, the AI community can play a key role in initiating a more nuanced and inclusive public discussion of the social and economic possibilities afforded by AI technologies. To pave the way for such dialogue, we suggest a line of research aimed at better understanding the nature, pace, and drivers of progress in AI in order to more effectively anticipate and shape AI's role in society.",
      "authors": {
        "institution": "Arizona State University",
        "name": "Miles Brundage"
      },
      "keywords": [],
      "references": {
        "reference_title": "The Glass Cage: Automation and Us"
      },
      "title": "Economic Possibilities for Our Children: Artificial Intelligence and the Future of Work, Education, and Leisure"
    },
    "papers/brundage_-_solar_thermal_technology_(ch._5).cermxml": {
      "abstract": "",
      "authors": {
        "name": "Miles Brundage"
      },
      "keywords": [],
      "references": {},
      "title": "Solar Thermal Technology"
    },
    "papers/brundage_solar_thermal.cermxml": {
      "abstract": "Solar thermal power, also known as concentrating solar power, is a renewable source of energy that captures solar radiation the form of heat and uses that heat to drive a turbine that generates electricity. (Solar photovoltaic cells, in contrast, directly convert sunlight to electricity). Several large-scale solar thermal power plants have been built in the United States, and more are currently under construction in the Southwestern United States, California, and in countries including Spain, Israel, South Africa, and India. Compared to solar photovoltaics, solar thermal energy has the advantage of being able to store energy for hours in the form of heat, which allows production of electricity into the night and smoothing out of fluctuations when the weather is cloudy. This storage capability, as well as the relative technical simplicity of solar thermal systems, and the availability and reasonable cost of constituent materials and components, has led to rapid growth in the market for solar thermal power plants, and promises substantial potential for future growth.",
      "authors": {
        "name": "Miles Brundage"
      },
      "keywords": [],
      "references": {},
      "title": "The Government Role in Developing Solar Thermal Technology"
    },
    "papers/colton_1_iccc11.cermxml": {
      "abstract": "We introduce computational creativity theory (CCT) as an analogue in computational creativity research to computational learning theory in machine learning. In its current draft, CCT comprises the FACE descriptive model of creative acts as tuples of generative acts, and the IDEA descriptive model of the impact such creative acts may have. To introduce these, we simplify various assumptions about software development, background material given to software, how creative acts are performed by computer, and how audiences consume the results. We use the two descriptive models to perform two comparisons studies, firstly for mathematical discovery software, and secondly for visual art generating programs. We conclude by discussing possible additions, improvements and refinements to CCT.",
      "authors": {
        "institution": "School of Informatics, University of Edinburgh",
        "name": "Alison Pease"
      },
      "keywords": [],
      "references": {
        "reference_title": "Computational learning theory: Survey and selected bibliography"
      },
      "title": "Computational Creativity Theory: The FACE and IDEA Descriptive Models"
    },
    "papers/colton_icml00.cermxml": {
      "abstract": "",
      "authors": {
        "name": "Simon Colton"
      },
      "keywords": [],
      "references": {},
      "title": "Automatic identification of mathematical concepts"
    },
    "papers/cook_cig11.cermxml": {
      "abstract": "- We present a system for generating complete game designs by evolving rulesets, character layouts and terrain maps in an orchestrated way. In contrast to existing approaches to generate such game components in isolation, our ANGELINA system develops game components in unison with an appreciation for their interrelatedness. We describe this multi-faceted evolutionary approach, and give some results from a first round of experimentation.",
      "authors": {
        "institution": "Computational Creativity Group at the Department of Computing of the Imperial College",
        "name": "Michael Cook"
      },
      "keywords": [],
      "references": {
        "reference_title": "Multi-objective exploration of the starcraft map space"
      },
      "title": "Multi-Faceted Evolution Of Simple Arcade Games"
    },
    "papers/evolutionary_enhancement.cermxml": {
      "abstract": "Human beings are a marvel of evolved complexity. Such systems can be difficult to enhance. When we manipulate complex evolved systems which are poorly understood, our interventions often fail or backfire. It can appear as if there is a “wisdom of nature” which we ignore at our peril. Sometimes the belief in nature's wisdom - and corresponding doubts about the prudence of tampering with nature, especially human nature - manifest as diffusely moral objections against enhancement. Such objections may be expressed as intuitions about the superiority of the natural or the troublesomeness of hubris, or as an evaluative bias in favor of the status quo. This paper explores the extent to which such prudence-derived anti-enhancement sentiments are justified. We develop a heuristic, inspired by the field of evolutionary medicine, for identifying promising human enhancement interventions. The heuristic incorporates the grains of truth contained in “nature knows best” attitudes while providing criteria for the special cases where we have reason to believe that it is feasible for us to improve on nature.",
      "authors": {
        "institution": "Oxford Future of Humanity Institute Faculty of Philosophy",
        "name": "Nick Bostrom"
      },
      "keywords": [],
      "references": {
        "reference_title": "In defense of the Expensive Tissue Hypothesis. Evolutionary Anatomy of the Primate Cerebral Cortex"
      },
      "title": "The Wisdom of Nature: An Evolutionary Heuristic for Human Enhancement"
    },
    "papers/utopiapaperai.cermxml": {
      "abstract": "",
      "authors": {
        "name": "Miles Brundage"
      },
      "keywords": [],
      "references": {},
      "title": "Utopia, Artificial Intelligence, and the Future of Justice"
    }
  }
}
